sys/206.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
                &lt;SYSMessage&gt;
                    &lt;messageGuid value="<%=messageGuid %>" /&gt;
                    &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="206" value="Asi Sonrasi Istenmeyen Etki Veri Seti" /&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
            &lt;author&gt;
            &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
            &lt;/author&gt;
            &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
            &lt;recordData&gt;
                        &lt;ASI_SONRASI_ISTENMEYEN_ETKI&gt;
                            &lt;ASI_ISTENMEYEN_ETKI_BILGISI&gt;
                                &lt;ASI version="1" codeSystemGuid="c3dbbb53-3b59-06e1-e043-14031b0a9fe6" code="<%=ASI.KODU %>" value="<%=ASI.ADI %>" /&gt;
                                    &lt;ASIE_ORTAYA_CIKIS_TARIHI value="<%=ASIE_ORTAYA_CIKIS_TARIHI %>" /&gt;
                                    &lt;ASININ_DOZU version="1" codeSystemGuid="da92a50e-b1a8-4e6a-be8c-2b6ca2c0a58b" code="<%=ASININ_DOZU.KODU %>" value="<%=ASININ_DOZU.ADI %>" /&gt;
                                    &lt;ASI_UYGULAMA_YERI version="1" codeSystemGuid="eb66330f-2b96-40a7-931e-fc9aed2b9409" code="<%=ASI_UYGULAMA_YERI.KODU %>" value="<%=ASI_UYGULAMA_YERI.ADI %>" /&gt;
                                    &lt;BILDIRIMI_ZORUNLU_ASI_SONRASI_ISTENMEYEN_ETKI_NEDENI version="1" codeSystemGuid="c6652612-6fcb-6fa8-e040-7c0a011670bd" code="<%=BILDIRIMI_ZORUNLU_ASI_SONRASI_ISTENMEYEN_ETKI_NEDENI.KODU %>" value="<%=BILDIRIMI_ZORUNLU_ASI_SONRASI_ISTENMEYEN_ETKI_NEDENI.ADI %>" /&gt;
                                    &lt;/ASI_ISTENMEYEN_ETKI_BILGISI&gt;
                          
                            &lt;/ASI_SONRASI_ISTENMEYEN_ETKI&gt;
                            &lt;HASTA_TAKIP_BILGISI&gt;
                            &lt;SYSTakipNo value="<%=SYSTakipNo %>" /&gt;
                            &lt;/HASTA_TAKIP_BILGISI&gt;
                            &lt;/recordData&gt;
                            &lt;/SYSMessage&gt;
                           </input>
                        </SYSSendMessage>
                        </s:Body>
                </s:Envelope>               